---
kind: type
id: T:Autodesk.Revit.DB.ViewDuplicateOption
source: html/a67f43c7-d350-ca90-ec69-304bde9c7262.htm
---
# Autodesk.Revit.DB.ViewDuplicateOption

Options for duplicating views

## Syntax (C#)
```csharp
public enum ViewDuplicateOption
```